In [18]:
import pandas as pd

In [19]:
import numpy as np

In [35]:
data={"Name":["A","B","C","D"],"Team":["X","X","Y","Y"],"Salary":[50000,55000,52000,53000],"Profit":["45","30","60","25"]}

In [36]:
dt=pd.DataFrame(data)
dt

  Name Team  Salary Profit
0    A    X   50000     45
1    B    X   55000     30
2    C    Y   52000     60
3    D    Y   53000     25

In [37]:
group=dt.groupby("Team")

In [38]:
group

In [39]:
dt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Team    4 non-null      object
 2   Salary  4 non-null      int64
 3   Profit  4 non-null      object
dtypes: int64(1), object(3)
memory usage: 260.0+ bytes

In [40]:
type("Salary")

str

In [42]:
avg=group["Salary"].mean()

In [43]:
avg

Team
X    52500.0
Y    52500.0
Name: Salary, dtype: float64

In [45]:
group.agg({"Salary":"mean","Profit":"sum"})

       Salary Profit
Team
X     52500.0   4530
Y     52500.0   6025

In [ ]:
print(0